In [1]:
import os
os.getcwd()

'C:\\Users\\Craig D\\Code\\atree\\data'

In [16]:
import pandas as pd
df = pd.read_csv("IMD_Precipitation_and_allied_1901_2003.csv")
# df = df.iloc[:38,]   # use this to subset only the first district
df.tail()

,stateid,districtid,State,state_dist_key,Distict,year,jan,feb,mar,apr,may,jun,jul,aug,sep,oct,nov,dec
58747,29,22,KARNATAKA,s29d22,MANDYA,2000,0.00,72.84,0.95,897.50,794.99,2930.56,4189.17,5492.38,1556.94,2973.88,289.21,220.82
58748,29,22,KARNATAKA,s29d22,MANDYA,2001,0.00,10.25,16.34,1362.74,1037.75,1359.32,4662.15,2212.59,1621.41,1749.93,420.97,61.91
58749,29,22,KARNATAKA,s29d22,MANDYA,2002,0.00,2.21,9.73,171.01,2430.00,5147.10,1672.01,1762.69,672.05,2439.75,433.34,32.60
58750,29,23,KARNATAKA,s29d23,HASSAN,1901,22.72,199.12,134.36,137.76,1305.04,5246.23,5873.51,3565.46,2496.85,2948.93,1309.15,248.31
58751,29,23,KARNATAKA,s29d23,HASSAN,1902,55.35,13.62,81.66,575.36,1307.76,7344.55,7246.30,2380.41,1532.91,3171.89,718.76,472.91

In [17]:
df.shape

(58752, 18)

In [9]:
print(df.columns.tolist())

['  stateid', 'districtid', 'State', 'state_dist_key', 'Distict ', 'year', 'jan', 'feb', 'mar', 'apr', 'may', 'jun', 'jul', 'aug', 'sep', 'oct', 'nov', 'dec']

In [12]:
id_vars = df.columns.tolist()[0:6]
var_name = "month"
value_name = "rainfall"

In [18]:
dflong = pd.melt(df,id_vars=id_vars,var_name=var_name, value_name=value_name)
dflong.head()

,stateid,districtid,State,state_dist_key,Distict,year,month,rainfall
0,2,3,HIMACHAL PRADESH,s2d3,LAHUL & SPITI,1965,jan,144.13
1,2,3,HIMACHAL PRADESH,s2d3,LAHUL & SPITI,1966,jan,67.26
2,2,3,HIMACHAL PRADESH,s2d3,LAHUL & SPITI,1967,jan,12.44
3,2,3,HIMACHAL PRADESH,s2d3,LAHUL & SPITI,1968,jan,342.72
4,2,3,HIMACHAL PRADESH,s2d3,LAHUL & SPITI,1969,jan,143.09

In [19]:
dflong.shape

(705024, 8)

In [29]:
dflong.columns

Index(['  stateid', 'districtid', 'State', 'state_dist_key', 'Distict ',
       'year', 'month', 'rainfall'],
      dtype='object')

In [32]:
dflong = dflong.loc[:,["State","Distict ","year","month","rainfall"]]
dflong.columns = ["State","District","year","month","precipitation"]
dflong.head()

              State       District  year month  precipitation
0  HIMACHAL PRADESH  LAHUL & SPITI  1965   jan         144.13
1  HIMACHAL PRADESH  LAHUL & SPITI  1966   jan          67.26
2  HIMACHAL PRADESH  LAHUL & SPITI  1967   jan          12.44
3  HIMACHAL PRADESH  LAHUL & SPITI  1968   jan         342.72
4  HIMACHAL PRADESH  LAHUL & SPITI  1969   jan         143.09

In [36]:
dflong.to_csv("IMD_Precipitation_1901_2003_long.csv")